#include <stdio.h>

#define M 2
#define N 3

int main_demo01()
{
	//-----------------------------------------------
	// 野指针
	// 野指针指的是指针中保存的是无效的内存地址。用户直接使用，系统会提示 段错误
	// int* p;
	// *p = 800;

	//-----------------------------------------------
	// void * 是一种特殊的指针类型，可用于存放任意对象的地址
	// int data = 100;
	// void* p = &data;
	// printf("result = %d\n", * (int *)p);

	//-----------------------------------------------
	// NULL
	// int data = 800;
	// int* p = NULL;
	// p = &data;
	// printf("result = %d\n", *p);

	//-----------------------------------------------
	// char* x;
	// short* y;
	// int* z;
	// printf("sizeof(x) = %ld\n", sizeof(x)); //8
	// printf("sizeof(y) = %ld\n", sizeof(y)); //8
	// printf("sizeof(z) = %ld\n", sizeof(z)); //8

	//-----------------------------------------------
	//char* x;
	//short* y;
	//int* z;

	//int t = 0x12345678;
	//printf("t\t%p\n", &t);

	//x = (char*)&t;
	//y = (short*)&t;
	//z = &t;
	//printf("x:\t%p\n", x);
	//printf("y:\t%p\n", y);
	//printf("z:\t%p\n", z);

	//// %#x是指带格式的16进制输出
	//printf("x = %#x\t p = %p\n", *x, x);
	//printf("y = %#x\t p = %p\n", *y, y);
	//printf("z = %#x\t p = %p\n", *z, z);

	////不通类型的指针++，偏移的位置不通，x++移动一字节、y++移动两字节、z++移动4字节
	//x++; 
	//y++;
	//z++;

	//printf("x = %#x\t p = %p\n", *x, x);
	//printf("y = %#x\t p = %p\n", *y, y);
	//printf("z = %#x\t p = %p\n", *z, z);

	//-----------------------------------------------
	//int a[5] = { 10, 20, 30, 40, 50 };
	//int* p = a;

	//p++; // true
	//a++; // error， a为地址常量，是数组第一个元素的地址，系统自动分配。 由于是一个常量，用户不能更改
	// 
	//-----------------------------------------------
	//char c[5] = { 'a', 'b', 'c', 'd', 'e'};
	// &c是 char c[5]类型
	// &c + 1 是为 c[5]地址的下一个地址

	//-----------------------------------------------

	//int a = 10;
	//int b = 20;
	//int c = 30;
	//int* p[3] = {&a, &b, &c};
	//
	//int len = sizeof(p) / sizeof(p[0]);
	//printf("len = %d\n", len);
	//for (int i = 0; i < len; i++)
	//{
	//	printf("%p \t %d\n", p[i], *p[i]);
	//}

	//-----------------------------------------------
	//char a[] = { "zhao" };
	//char b[] = { "qian" };
	//char c[] = { "sun" };

	//char* q[] = { a, b, c, NULL };
	//int i = 0;
	//char* t = NULL; 

	//printf("%c\n", *q[0]);
	//printf("%c\n", *(q[0] + 1));

	//for (i = 0; q[i] != NULL; i++)
	//{
	//	for (t = q[i]; *t != '\0'; t++)
	//	{
	//		printf("%c ", *t);
	//	}
	//	printf("\n");
	//}
	//-----------------------------------------------

	//int a = 100, b = 200, c = 300;
	//int i = 0;
	//int* t[] = { &a, &b, &c, NULL };
	//int** q = t;

	//for (i = 0; t[i] != NULL; i++) 
	//{
	//	printf("%d ", *t[i]);
	//	printf("%d ", *(*(t + i)));
	//	printf("%d ", *(*(q + i)));
	//	printf("%d ", *q[i]);
	//}
	//-----------------------------------------------
	//数组指针
	//int a[3][4];
	//int(*p)[4];

	//int a[M][N] = { 10, 20, 30, 40, 50, 60 };
	//int(*p)[3] = a;
	//int* q = a;

	//printf("a[1][1] = %d\n", a[1][1]);
	//printf("*(a[1]+1) = %d\n", *(a[1] + 1));
	//printf("*(*(a+1)+1) = %d\n", *(*(a + 1) + 1));

	//printf("p[1][1] = %d\n", p[1][1]);
	//printf("*(p[1]+1) = %d\n", *(p[1] + 1));
	//printf("*(*(p+1)+1) = %d\n", *(*(p + 1) + 1));

	////printf("q[1][1] = %d\n", q[1][1]); //错误
	//-----------------------------------------------
	//const 同名称不可修改，通过指针可以修改，只是在编译器进行检查，

	//const 除了修改时变量外，还可以修饰值，修饰值有一下几种方法
	//int const *p //指针p本身的值可以修改，但是p所指向的内容不能修改（*p不能改）
	//const int *p //指针p本身的值可以修改，但是p所指向的内容不能改变（*p不能改）
	
	//int *const p;//指针p本身的值不能改变，但是p所指向的内容可以改（p不能改）
	
	//int const * const p; //指针p本身的值不能改，并且p所指向的内容不能改（p和*p都不能改）
	//const int * const p; //指针p本身的值不能改，切p所指向的内容不能改（p和*p都不能改）
	//
	const int a = 100;

	int* p = &a;
	*p = 300;

	printf("%d\n", a);

	return 0;
} 